app/controllers/authors_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def posts
    @author = get_author_by_id
    @post = Post.find(params[:post_id])